{"posts":[{"comment_count":131,"sentiment_score":"Neutral","has_embedded_media":false,"created_at":1637027787,"title":"They’re Still Doing Ads for Hello Fresh lol","platform":"reddit","sentiment_confidence":0,"post_id":"t3_quwgwo","top_comments":[],"positive_votes":270,"text":"Hasan mentioned they were taking it off Leftovers but I guess Ethan decided it’s still okay for the other shows, kind of ironic. \n\nI feel like there’s genuine things you can criticize Ethan for but everyone always says the dumb stuff that’s been disproven time and time again; this is one of those actual instances of deserved criticism.","poster_id":"t2_42myej0g","lang":""},{"comment_count":316,"sentiment_score":"Neutral","has_embedded_media":false,"created_at":1637827910,"title":"Hello there ladies and gentlemen","platform":"reddit","sentiment_confidence":0,"post_id":"t3_r1rov9","top_comments":[],"positive_votes":5963,"text":"","poster_id":"t2_6yd2lnqu","lang":""},{"comment_count":924,"sentiment_score":"Neutral","has_embedded_media":false,"created_at":1635511992,"title":"Hello to the people from r/all! DO NOT use Robinhood!!","platform":"reddit","sentiment_confidence":0,"post_id":"t3_qic54m","top_comments":[],"positive_votes":27868,"text":"Robinhood may seem like the quick and easy way to buy stocks but they are against you!\n\nOn January 28th, they did not allow people to buy more shares; they only allowed people to sell. They were about to default so they turned off the buy button and shorted the stock in order to drop the price. Go back and look at the ticker for January-February: $483 &gt; $43. The law enforcement agency of the stock market, the SEC, has gone on record stating this as fact.\n\nWhen Dog Crypto had its run up in April, they did this same tactic 3 more times. They will do it again!\n\nThe best companies are Fidelity or Computershare. Yes, they take a couple days to get an account but it’s okay, we’ll wait. We’re saving you a seat. We’ve waited 9+ months already. The squeeze won’t happen all in one day. But don’t wait too long because we’re in ~90 day cycle and the price is going to start rising again over the next couple weeks.\n\nThis is for CYA purposes only—&gt;I am not a financial advisor and this is all my own opinion.\n\nEDIT: For people transferring from Robinhood to another broker, I'm quoting u/AMKoochie \"Keep record of your cost basis. RH has not been purchasing shares. So they end up stuck purchasing share now for whatever price they are forced to buy at now.\n\nOnce those shares make their way over, keep an eye on your cost basis. It most likely won't show up for a week or 2, but when it eventually does show up you may see a difference of hundreds or even thousands of dollars. Many many people have.\n\nIt's helpful for tax purposes as well as evidence of fraud.\"\n\nALSO EDIT: You are loved and I want the best for you.\n\nEDIT III: A lot of questions on how to transfer out of RH to a new broker. When I did it months ago, I setup an account with Fidelity then called them. They are so used to this request that it's super easy for them to do. They handle the rest for you by putting in a request to your old broker. I think there used to be a DD for this with phone numbers. I can't seem to find it so if someone does, I will add it to this edit.","poster_id":"t2_7mls1","lang":""},{"comment_count":1427,"sentiment_score":"Neutral","has_embedded_media":false,"created_at":1636102436,"title":"Hello from Estonia. Dear Americans, Why won't you leave?","platform":"reddit","sentiment_confidence":0,"post_id":"t3_qn6uqh","top_comments":[],"positive_votes":3993,"text":"*EDIT: Those who downvote this post - I really don't mind that you do. But would you mind commenting below to let me know why you chose to do it?*\n\n**Hi all,**\n\n**this might become a long post. Please bear with me.**\n\nI was born during soviet times ( year '79 ) in Soviet Estonia. We gained our freedom in '91, and in the last 30 years, we've built our country to be a pretty good one. We did not have any industries, so, thanks to the excellent foresight of our first leaders, we built an IT industry. We are not a rich country. We are still one of the poorest in the EU.\n\nDuring the first covid wave at the beginning of 2020, I quit my job to help my wife raise our two boys. I started looking for a new one at the end of 2020 and found one - or rather, the job found me, in the first half of 2021. The funny part - it's a silicon valley startup. I'm not working in the USA. I'm their first employee in the EU.\n\nSo when I was planning to fly over, I thought that perhaps I should prepare some slides to introduce my country of origin to them by comparing the US and my tiny Estonia. I looked up some international statistics and found out that Estonia is ahead of the USA in most things - Life expectancy, rate of infant mortality, suicides, life happiness, and so on. I gave up on the idea of the presentation, because I thought that my coworkers would take it as me gloating.\n\nWhy I'm telling you all this is because in the beginning for Independent Estonia, we had a problem. Many of our youth sought a life outside of Estonia - because our neighbours - Finland and Sweden - offered much, MUCH better income and life quality. We are a small nation, and losing brains and bodies to other countries hurts us a lot. In fact, losing bright minds to another country is one of the worst things that can happen to a country. Because teaching new ones takes time. This is one of the facts why the EU (and the USA) are quite willing to accept new workforce from outside. They all know that sooner or later, they can use this workforce.\n\nSo finally, to the point, I'm making. Just leave, guys. Do what your forefathers did - leave your country of origin in search of a better life. This is, in fact, the best way you can affect your countries policies. You have seen for years and years, that no real change comes through your two-party political system. They'll take notice, when they notice the growing trend of outwards migration of bright minds. For example - According to the news, Russia lost 1 000 000 people last year. Due to Covid and outwards migration. I've employed a few of those guys, and they were excellent.\n\nI know leaving would be challenging, but it's not that hard. Because by leaving, you and your children will gain more than you lose. For example. After 30 years of independence, Estonian citizens get:\n\n* 28 to 35 days of paid vacation per year. Companies are required by law to send people on vacation.- 28 to 35 days of paid leave per year. As a team leader, I had to remind my team members, that they needed to fucking plan a vacation and take a break.\n* Extra 3 ( some companies offer more ), paid health days per year, where you can just call up in the morning and tell your boss, that you are taking health day - to do whatever the fuck you want. Visit a doctor or go to the beach.\n* 18 months of paid leave when you get a child. The leave usually starts 30 to 60 days before the birth, upon which the mother is paid four months worth of salary by the country. So they have time to prepare for the birth. After birth, the mother has 18 months to raise the kid while staying at home and raising the newborn.\n* Fathers are given 2 - 4 weeks off, when the child has born, to help their wife recover.\n* having a child, much like any other healthcare, is free. If you want, you can pay some extra and get paid \"family rooms\" while your wife is at the hospital. Then you can stay at the hospital with your wife for some days. That usually costs like 30€ per night.\n* Healthcare, as I said, is free. For certain doctors, there are wait times. If you do want to use private healthcare, you can. Then the visit to a doctor might cost between 40 to 60 euros. In Estonia, we do not have dental plans like US companies offer, so that is a cost that one has to pay out of their pockets, but some employers are already adopting different plans to help their employees with those costs also.\n* Tuition is free for Estonian citizens. University/college also. There are paid universities and colleges too.\n\nNow I told you that My employer is a Silicon Valley startup. So I got a chance to visit the San Jose, California this year in July/August. TBH, it was not a nice sight. The permeating feeling of insecurity, that each American feels was crazy. I don't know if you guys are aware of how insecure you feel or not. What do I mean by that? Here's a story for you. I arrived at San Jose airport around 1 am at night. I noticed my hotel was just 15-20 minutes from the airport, so I decided to walk. When I told about this to my coworkers next Monday, they looked at me like I was crazy. I told them I was planning to walk back to the airport at 4am when I was going to leave too. They told me not to do this, because they feared for my life. I asked them to explain. But the better explanation I witnessed with my own eyes.\n\nWhile driving back to the office from lunch, I noticed a homeless person lying on the curb under the thick black blanket (under 90F sun). I had to pass by the same intersection again in 10 minutes, so I wondered if I'd see the same guy again. I did. He had already crossed the intersection and was masturbating furiously on the curb, in the middle of the day. In broad daylight around 13:00. And it was a big intersection too. So those kinds of people were the ones that my coworkers were afraid of. People who are not mentally well and are forced on the sidelines of society - and the rest of the society lives in fear of meeting those people. Then I understood what my coworkers were afraid of. And you know what? Most of the EU, or for the very least, Most of my country, is not. Because the country takes care of those people and makes sure, they are well. This is why you need social security - so that everybody can feel safe. And not the American way of safe - everyone in their cars - but 4am-walk-safe. Everyone in my country can just step outside at any time and have a walk and be 100% sure that it will be ok. Nobody needs guns, nobody is afraid of being robbed, nobody is afraid of crazy homeless persons.\n\nOne last point to consider. Historically, governments and countries are meant to take care of big amounts of people. That's the whole reason people grouped together. To be stronger together. If, however, the government stops caring for the majority of its people and concentrates on the well-being of a minority, then the people have a limited amount of choices: Revolution or Leaving. I'm not advocating for revolution, because that hurts the people too. But leaving hurts people much less, than the government and the country.\n\nSo think about it. What kind of life do you want? What kind of life do you want for your kids? Just leave. Look at Australia, New Zealand, EU. Most countries have some sort of programs for skilled immigrants.\n\nJust my thoughts. I hope I'm not going to get downvoted to oblivion. Because I'm sort of tired of seeing how powerless some of the posts in this subreddit are and how powerless the people feel. You guys have the power as people. Exercise it. Vote with your legs and just leave.","poster_id":"t2_ga2pi","lang":""},{"comment_count":194,"sentiment_score":"Neutral","has_embedded_media":false,"created_at":1637811540,"title":"Say hello to my new family member, Gruber. He is a sable German shepherd.","platform":"reddit","sentiment_confidence":0,"post_id":"t3_r1mzg1","top_comments":[],"positive_votes":12477,"text":"","poster_id":"t2_8ng5nugy","lang":""},{"comment_count":199,"sentiment_score":"Neutral","has_embedded_media":false,"created_at":1637957527,"title":"Hello","platform":"reddit","sentiment_confidence":0,"post_id":"t3_r2vq9t","top_comments":[],"positive_votes":7886,"text":"","poster_id":"t2_e4j6a8lu","lang":""},{"comment_count":20361,"sentiment_score":"Neutral","has_embedded_media":false,"created_at":1631634249,"title":"Hello from Crytek! We're giving away 20 Crysis Remastered Steam Keys","platform":"reddit","sentiment_confidence":0,"post_id":"t3_po5bzs","top_comments":[],"positive_votes":7437,"text":"Hi everyone!\n\nI'm Utku Çakır, community manager for Crysis at Crytek. **Crysis Remastered** is coming to **Steam** this **Friday** and I have **20** Crysis Remastered Steam **keys** for r/pcgaming.\n\nYou can **Wishlist** the game [here](https://store.steampowered.com/app/1715130/Crysis_Remastered).\n\nSince the initial EGS release last year, we’ve added **Nvidia DLSS** support, **The Ascension** level from the original game, fixed a bunch of bugs, did some performance improvements on Ray Tracing, and more. If you haven’t played the game on EGS, I think this is the best time to get in on the action as it will have a total of **50% discount** for the first week of launch + owners of the original Crysis on Steam. And, if you happen to own Hunt: Showdown, you’ll get an extra discount on top of that.\n\nTo join the giveaway just comment “**I’m in!**” and I'll get in touch with the winners at the end of the week. You have until this week Friday at 7 PM CET to enter it. Good luck!\n\n*P.S.:* If you want, you can give us a follow on our social media channels as well 😉\n\n[Twitter](https://twitter.com/crysis)\n\n[Facebook](https://www.facebook.com/crysis)\n\n[Instagram](https://www.instagram.com/crysis/)","poster_id":"t2_9w6n0ma5","lang":""},{"comment_count":707,"sentiment_score":"Neutral","has_embedded_media":false,"created_at":1636017120,"title":"Hello there","platform":"reddit","sentiment_confidence":0,"post_id":"t3_qmgmbl","top_comments":[],"positive_votes":10072,"text":"","poster_id":"t2_f97kyy3f","lang":""},{"comment_count":1718,"sentiment_score":"Neutral","has_embedded_media":false,"created_at":1634914391,"title":"Hello I'm Fuc F'Uckry 😎🖐🏼","platform":"reddit","sentiment_confidence":0,"post_id":"t3_qdim4s","top_comments":[],"positive_votes":7701,"text":"","poster_id":"t2_3ugqxzu6","lang":""},{"comment_count":280,"sentiment_score":"Neutral","has_embedded_media":false,"created_at":1638050129,"title":"Hello! (if this gets enough comments) the top 10 items commented will be removed until there are only around 5 left from each dlc. After I do all the dlcs I will beat a run with only those 20 items. PS If there are more than 1 active item I will randomize which I take.","platform":"reddit","sentiment_confidence":0,"post_id":"t3_r3nzie","top_comments":[],"positive_votes":1219,"text":"","poster_id":"t2_e03z25dt","lang":""},{"like_count":"25373","created_at":"2021-11-28T22:04:33.000Z","text":"Q about how the members feel about the amas and grammy nominations and the concert last night:\n\nV: hello i'm V nice to meet you. i'm very happy that we're having this in person concert for the first time in two years...we hope we can impart some very positive energy to army","id":"1465079191028699138","reply_count":"67","lang":"en","author_id":"247156230","quote_count":"1018","platform":"twitter"},{"like_count":"309","created_at":"2021-11-28T13:53:06.000Z","text":"hello po! it’s been a week since i’ve been kicked out of my fam’s house (abusive) po and i’m currently staying at my friend’s house.. i’m asking for help po to buy ready to eat/canned foods po to survive everyday.. I already sold everything i can sell din po🙏🏻 thank u so much po! https://t.co/Zu7wvPtEyP","id":"1464955512932368394","reply_count":"1","lang":"en","author_id":"1385635657586941952","quote_count":"2","platform":"twitter"},{"like_count":"0","created_at":"2021-11-28T23:16:29.000Z","text":"layout yang bisa req 3 chara donggg, ada gaaak?? #zonauang #zonajajan #zonabu #zonaba","id":"1465097293279887363","reply_count":"1","lang":"in","author_id":"1429239663051436032","quote_count":"0","platform":"twitter"},{"like_count":"34701","created_at":"2021-11-27T23:11:43.000Z","text":"HELLO JUNGKOOK?&amp;/!$2)?? https://t.co/ThSDICxugl","id":"1464733707458297862","reply_count":"57","lang":"in","author_id":"734334955996762112","quote_count":"520","platform":"twitter"},{"like_count":"0","created_at":"2021-11-28T23:17:06.000Z","text":"HELLO I WAS ABOUT TO SLEEP","id":"1465097446988693516","reply_count":"0","lang":"en","author_id":"1388359710517174273","quote_count":"0","platform":"twitter"},{"like_count":"12343","created_at":"2021-11-28T07:02:36.000Z","text":"HELLO #PTD_ON_STAGE_LA https://t.co/icXHqNFJ2n","id":"1464852209233846273","reply_count":"51","lang":"en","author_id":"894366427678818306","quote_count":"375","platform":"twitter"},{"like_count":"3545","created_at":"2021-11-27T15:45:33.000Z","text":"hello #bsc  @BinanceChain @cz_binance \nwe bring #Dfinity to #bsc\nlet's make some noises\n@BinanceChain @dfinity @SnapshotLabs @ensdomains https://t.co/cxwR7yTyjW","id":"1464621424442998785","reply_count":"57","lang":"en","author_id":"1430549803990011908","quote_count":"18","platform":"twitter"},{"like_count":"0","created_at":"2021-11-28T23:17:05.000Z","text":"IM GONNA CRY RANBOOS DEAD AND DREAM IS FREE ????? HELLO I CANT REWATCH I NEED TO FINISH MY COLLEGE APPLICATIONS \n// dsmp , // rp","id":"1465097442458628099","reply_count":"0","lang":"en","author_id":"1338309027189510144","quote_count":"0","platform":"twitter"},{"like_count":"19516","created_at":"2021-11-28T12:12:23.000Z","text":"irene listening to joy’s “hello” whilst driving 🥺 https://t.co/rlvDP0pVps","id":"1464930167525199874","reply_count":"90","lang":"en","author_id":"1400433514458357763","quote_count":"1749","platform":"twitter"},{"like_count":"3","created_at":"2021-11-28T20:35:37.000Z","text":"@JeanetteEliz @AutumnL1722 @ky_33 @moonloght_22 @JeanetteEliz7 @monicasloves @visconti1779 @HeidiStea @Estrella51Ahora @peetahuja @LaurieL47782020 @bambi7782020 Awwwwwww\nSuch a beautiful, sweet Kitty.\nI’m loving the bow tie.💕🐈💕\nThank you 💐dear Jeanette.💞\nHello &amp; happy\n🐈#CatBoxSunday 📦to all dear 🤗friends.💖\nBig hugs 🤗 to everyone💞\n(Gif via Tenor) https://t.co/WXZ3mFertw","id":"1465056808528195588","reply_count":"0","lang":"en","author_id":"2896625957","quote_count":"0","platform":"twitter"}]}